<template>
  <div class="contract">
    <p>
        <!-- <span>　　合同号：读取客户手机号</span> -->
    </p>
    <p class="contract_title">
        <span>　　购买知识付费产品协议（说明）</span>
    </p>
    <p>
        <span>　　特别提示：您在同意购买协议前应完整、仔细地阅读本购买协议，您勾选同意将被视为完全理解并接受以下全部购买协议条款。本购买协议是您与华创证券（以下简称“华创证券”或“我们”）之间达成的协议。本协议自我们确认您的购买之日起生效。</span>
    </p>
    <p>
        <span>　　1. 购买</span>
    </p>
    <p>
        <span>　　1.1 成功购买华创证券所有的公众号内“知识付费产品”，即表示您同意并愿意遵守本订阅协议。</span>
    </p>
    <p>
        <span>　　1.2 您所成功购买“知识付费产品”的相关有所内容，其知识产权全部归“华创证券”所有。</span>
    </p>
    <p>
        <span>　　1.3 “知识付费产品”的购买价格包含投资顾问服务费，您无需另行付费。</span>
    </p>
    <p>
        <span>　　1.4 “知识付费产品”的购买价格不含任何税款。您必须支付依据本协议产生的、并且是适用法律允许我们向您收取的任何适用的增值税、销售税、其他交易税费、收费或附加费、其他法律规定的附加费或类似费用。</span>
    </p>
    <p>
        <span>　　1.5 购买成功后，我们授予您阅读相应“知识付费产品”的权利，我们保留所有其他权利。</span>
    </p>
    <p>
        <span>　　1.6 您对付费“知识付费产品”的使用必须遵循本协议。您不得对“知识付费产品”进行修改、复制与转发。</span>
    </p>
    <p>
        <span>　　1.7 您不得将“知识付费产品”内容其中的任何部分出租、租赁、出借、转售、转让或托管给第三方，不得明示或默示给任何第三人使用，不得再次销售“知识付费产品”，以及所涉及的本“知识付费产品”的部分和全部内容，不得以任何收费或免费的方式公开本“知识付费产品”内容。</span>
    </p>
    <p>
        <span>　　2.免责声明</span>
    </p>
    <p>
        <span>　　2.1您理解并同意，“知识付费产品”内容不做出任何明示或默示的保证，所有内容仅供参考，您已知晓投资风险并愿意自行承担。</span>
    </p>
    <p>
        <span>　　3. 违约责任</span>
    </p>
    <p>
        <span>　　3.1 如果出现下述一种或多种情况，则我们可在不通知的情况下暂停您付费“知识付费产品”的服务的使用或终止您的购买并回收您的购买帐户：</span>
    </p>
    <p>
        <span>　　3.1.1 您没有依照本协议支付应付款项；</span>
    </p>
    <p>
        <span>　　3.1.2 您未经我们书面许可擅自使用了我们的商标或其他标识、享有著作权的内容、及其他属于我们的权利；</span>
    </p>
    <p>
        <span>　　3.1.3您没有遵守使用方式政策或违反了本协议的其他条款。</span>
    </p>
    <p>
        <span>　　3.2如果您违反1.5条、1.6条、1.7条的约定，您应向我们支付5万元违约金。若您的违约行为给我们造成损失，您应赔偿相应损失。同时，我们保留对您提起诉讼的权利，且本条可作为我们提起诉讼时的追偿依据。</span>
    </p>
    <p>
        <span>　　4. 其他</span>
    </p>
    <p>
        <span>　　4.1 可分割性。如果本协议的任何部分被认定不可执行，其余内容仍然具备完全效力。</span>
    </p>
    <p>
        <span>　　4.2 适用法律和审判地。本协议受中华人民共和国法律的管辖。如就本协议内容或其执行发生任何争议，应尽量友好协商解决；协商不成时，任何一方均可向华创证券住所地人民法院提起诉讼。</span>
    </p>
    <p>
        <span>　　4.3 本协议中所表述的“日”、“天”均指日历日。</span>
    </p>
    <p>
        <span>　　4.4 我们拥有本协议的最终解释权。</span>
    </p>
    <p>
        <span>　　4.5我们有权随时对服务条款进行修改，一旦服务条款发生变更和修改，我们将在相关页面上提示修改的内容；如果您不同意本协议的修改，可以取消已经获取的服务并停止使用；如果您继续使用提供的服务，则视为您已经接受本协议的全部修改。</span>
    </p>
    <p>
        <span>　　5. 开具发票</span>
    </p>
    <p>
        <span>　　5.1 您如果需我们对您所购买的“知识付费产品”开具发票，您可联系客服进行登记，我们将于20个工作日之内将发票邮寄到您指定的地址。</span>
    </p>
    <p>
        <span>　　6. 退款</span>
    </p>
    <p>
        <span>　　6.1如果对于华创证券内“知识付费产品”的服务不满意，您可联系客服进行登记退款。</span>
    </p>
    <p>
        <span>　　6.2自签订协议起5个工作日内，您可以单方面通过与客服联系或者书面的通知的方式提出解除协议，华创证券以收到客户解除协议的通知日期为准，进行相应的协议的解除，您无需向我司缴纳任何服务费用，双方互不追究违约责任。</span>
    </p>
    <p>
        <span>　　6.3自签订协议起5个工作日后，您提出解除协议，应通过与客服联系或者书面的通知的方式向华创证券提出。华创证券以收到您解除协议的通知日期为准，进行与您的协商工作。协商达成一致后，进行相应服务与协议的解除，且有权利按天收取“知识付费产品”服务费（应收“知识付费产品”服务费=“知识付费产品”服务费总额/协议约定天数X实际履行天数）。</span>
    </p>
    <p>
        <span>　　6.4如果您曾经开据过本次购买“知识付费产品”的发票，您需要把同时把发票邮寄回我们指定的地址。</span>
    </p>
    <p>
        <span>　　7. 联系方式</span>
    </p>
    <p>
        <span>　　7.1 客服电话：4000885558</span>
    </p>
    <p class="contract_title">
        <span>　　<strong>华创证券证券投资顾问服务协议</strong></span>
    </p>
    <p>
        <span>　　【风险提示】</span>
    </p>
    <p>
        <span>　　我们承诺诚信提供专业服务，不承诺投资者获取投资收益，也不与投资者约定分享投资收益或分担投资损失。市场有风险，投资需谨慎。您勾选同意将被视为完全理解并接受以下全部证券投资顾问服务协议条款。本协议自我们确认您的购买之日起生效。</span>
    </p>
    <p>
        <span>　　根据《中华人民共和国证券法》、《中华人民共和国合同法》、《证券投资咨询管理暂行办法》和《证券投资顾问业务暂行规定》等相关法律、法规，以及中国证券业协会（以下称协会）的有关自律规则，本着平等、自愿、诚实信用的原则，就华创证券向您提供证券投资咨询服务事项，签订本协议。</span>
    </p>
    <p>
        <span>　　1、双方申明</span>
    </p>
    <p>
        <span>　　1.1华创证券有限责任公司（以下简称“华创证券”）系中国证监会核准的证券投资咨询专业机构；具备提供证券投资顾问服务的必要条件和专业能力。</span>
    </p>
    <p>
        <span>　　1.2您系证券市场合法投资者；知晓证券市场有风险，对华创证券告知的“风险提示”已清楚；并且详细阅读了本协议的所有条款并准确理解其含义。</span>
    </p>
    <p>
        <span>　　1.3双方共同遵守有关的法律、法规，不利用本协议的关系从事任何违法、违规行为。</span>
    </p>
    <p>
        <span>　　2、服务内容及方式</span>
    </p>
    <p>
        <span>　　2.1华创证券向您提供服务，服务内容包括：向您提供涉及证券及证券相关产品的投资建议服务，包括投资品种的选择、投资组合以及理财规划建议等。服务范围包括:股票、债券、基金、权证等。</span>
    </p>
    <p>
        <span>　　2.2华创证券向您提供服务采用如下方式：华创证券与其知识付费产品、微信、QQ、手机短信、电话等，不通过其它方式提供服务；您享受华创证券提供的研究资讯产品，包括证券资讯、策略研究等。如遇投资顾问与您沟通不畅，华创证券应根据具体情况妥善处理，包括调换投资顾问等，以确保您在协议期内的服务。</span>
    </p>
    <p>
        <span>　　3、华创证券的权利和义务</span>
    </p>
    <p>
        <span>　　3.1华创证券本着勤勉尽责、诚实守信的原则，为您提供专业、有偿的证券投资顾问服务。</span>
    </p>
    <p>
        <span>　　3.2华创证券有权根据提供的服务和协议约定收取咨询服务费，并享有所提供的研究分析结果的知识产权。</span>
    </p>
    <p>
        <span>　　3.3华创证券应当根据了解的您的情况，在评估您风险承受能力和服务需求的基础上，向您提供适当的投资建议服务。</span>
    </p>
    <p>
        <span>　　3.4华创证券保证其所提供的投资服务内容具有合理的根据。其依据包括证券研究报告或者基于证券研究报告、理论模型以及分析方法形成的投资分析意见等。</span>
    </p>
    <p>
        <span>　　3.5华创证券向您提供投资建议时，应当同时提示潜在的投资风险。</span>
    </p>
    <p>
        <span>　　3.6华创证券依法保护因服务关系而知悉的有关您的财产状况、投资决策计划及其他个人隐私。</span>
    </p>
    <p>
        <span>　　4、华创证券禁止行为</span>
    </p>
    <p>
        <span>　　4.1华创证券不得代理您从事证券、期货等金融产品的投资买卖。</span>
    </p>
    <p>
        <span>　　4.2不得向您承诺证券、期货等金融产品的投资收益。</span>
    </p>
    <p>
        <span>　　4.3不得与您约定分享您证券投资的收益或分担投资的损失。</span>
    </p>
    <p>
        <span>　　4.4为自己买卖股票及具有股票性质、功能的证券以及期货。</span>
    </p>
    <p>
        <span>　　4.5不得利用咨询服务与他人合谋操纵市场或者进行内幕交易。</span>
    </p>
    <p>
        <span>　　4.6法律、法规、规章所禁止的其他证券、期货欺诈行为。</span>
    </p>
    <p>
        <span>　　5、您的权利与义务</span>
    </p>
    <p>
        <span>　　5.1您自愿购买知识付费产品，并成为华创证券的客户，享受华创证券提供的证券投资顾问服务。</span>
    </p>
    <p>
        <span>　　5.2您基于独立的判断，自行作出投资决策，承担投资风险。</span>
    </p>
    <p>
        <span>　　5.3您不得与华创证券另行签订证券投资收益共享、损失分担的约定。</span>
    </p>
    <p>
        <span>　　5.4您不得将华创证券提供的研究分析结果或建议泄露给任何第三方。</span>
    </p>
    <p>
        <span>　　5.5您根据协议约定支付投资顾问服务费。</span>
    </p>
    <p>
        <span>　　6、投资顾问服务费与支付途径</span>
    </p>
    <p>
        <span>　　6.1您应向华创证券支付所选知识付费产品对应约定的全部金额作为证券投资顾问服务费。</span>
    </p>
    <p>
        <span>　　6.2您应通过华创证券提供的第三方支付渠道（如微信、支付宝等），向华创证券缴纳证券投资顾问服务费。</span>
    </p>
    <p>
        <span>　　7、服务期限</span>
    </p>
    <p>
        <span>　　7.1本协议约定服务期为所购知识付费产品相应的订阅期限。</span>
    </p>
    <p>
        <span>　　7.2通过活动形式获取本服务产品的，以活动约定期限为准，自满足活动条件第二天起生效。</span>
    </p>
    <p>
        <span>　　8、不可抗力</span>
    </p>
    <p>
        <span>　　8.1对于华创证券无法预测或无法控制的设备故障、通讯故障及其它人力不可抗力而造成服务中断的情况，华创证券不承担责任，但应尽快将发生不可抗力事故的情况通知您，并在您要求时提供有关证明文件。</span>
    </p>
    <p>
        <span>　　9、争议的解决</span>
    </p>
    <p>
        <span>　　9.1凡因执行本协议所发生的或与本协议有关的一切争议，甲乙双方应本着善意通过友好协商解决。协商不成的，可申请由协会调解，调解不成或不符合协会调解规定的，应选择下述两种方式之一解决，</span>
    </p>
    <p>
        <span>　　（一）提交“贵阳仲裁委员会”，按照申请仲裁时该会现行有效的仲裁规则进行仲裁。仲裁裁决是终局的，对双方均有约束力。仲裁费由败诉方承担。</span>
    </p>
    <p>
        <span>　　（二）向有管辖权的法院提起诉讼。</span>
    </p>
    <p>
        <span>　　9.2在争议处理过程中，除正在进行审理的部分外，协议的其它部分将继续执行，任何一方不得因发生争议故意损害或恶意诋毁另一方，不得威逼、利诱、恐吓对方，不得干扰和破坏对方的工作、学习和生活，如果违背本条款必须向对方赔付双倍于本协议所涉款项之违约金。</span>
    </p>
    <p>
        <span>　　10、协议变更和终止</span>
    </p>
    <p>
        <span>　　10.1自签订协议起5个工作日内，您可以单方面通过与客服联系或者书面的通知的方式提出解除协议，华创证券以收到客户解除协议的通知日期为准，进行相应的《证券投资顾问服务协议》解除，您无需向我司缴纳任何服务费用，双方互不追究违约责任。</span>
    </p>
    <p>
        <span>　　10.2自签订协议起5个工作日后，您提出解除协议，应通过与客服联系或者书面的通知的方式向华创证券提出。华创证券以收到您解除协议的通知日期为准，进行与您的协商工作。协商达成一致后，进行相应服务与协议的解除，且有权利按天收取投资顾问服务费（应收投资顾问服务费=投资顾问服务费总额/协议约定天数X实际履行天数）。</span>
    </p>
    <p>
        <span>　　10.3本协议签署生效后，若有关法律、法规及行业规定已修订，本协议涉及内容及条款按新修订的法律法规执行，但其它内容及条款继续有效。如本协议与新的法律法规严重背离，双方有义务在体现原协议要义的基础上修改本协议，或重新签署协议。</span>
    </p>
    <p>
        <span>　　10.3自签订协议起5个工作日后，需甲乙双方经协商同意后，方可解除或修改本协议。</span>
    </p>
    <p>
        <span>　　10.4若此协议一方愿意续约，必须在此协议到期之日前征得另一方同意后重新签订服务协议。</span>
    </p>
    <p>
        <span>　　11、华创证券拥有本协议最终解释权。</span>
    </p>
    <p class="contract_title">
        <span>　　<strong>证券投资顾问业务风险揭示书</strong></span>
    </p>
    <p>
        <span>　　尊敬的客户：</span>
    </p>
    <p>
        <span>　　为了使您充分了解投资顾问业务的风险，本公司依据国家证券主管部门颁布的《证券投资顾问业务暂行规定》向投资者（客户）提供《证券投资顾问业务风险揭示书》，以便充分揭示证券投资顾问服务中所存在的风险或潜在的风险。《证券投资顾问业务风险揭示书》由投资者确认签收后生效，并由本公司进行证券投资顾问业务的档案保存工作。</span>
    </p>
    <p>
        <span>　　1、在您接受证券投资顾问服务之前，须确认您已通过中国证券业协会网站（www.sac.net.cn）核实并确认华创证券有限责任公司（以下简称“本公司”）是具有中国证监会颁发的证券投资咨询业务资格（经营证券期货业务许可证号：13090000）的专业证券投资顾问公司；同时，本公司提供证券投资顾问服务的人员是具备证券投资顾问执业资格并已经注册登记的专业证券投资顾问。</span>
    </p>
    <p>
        <span>　　2、在您接受证券投资顾问服务之前，须了解证券投资顾问业务是证券投资咨询业务的一种基本形式，指证券公司、证券投资咨询机构接受客户委托，按照约定，向客户提供涉及证券及证券相关产品的投资建议服务，辅助客户作出投资决策，并直接或者间接获取经济利益的经营活动。投资建议服务内容包括投资的品种选择、投资组合以及理财规划建议等。因此广大客户在接受本公司所提供的证券投资顾问服务前，必须了解证券投资顾问业务的含义，理解投资者接受证券投资顾问服务后需自主作出投资决策并独立承担投资风险。</span>
    </p>
    <p>
        <span>　　3、在您接受证券投资顾问服务之前，须了解本公司及其人员提供的证券投资顾问服务不能确保您获得盈利（不承诺或者保证投资收益）或本金不受损失。您对自身的风险承受能力应有合理的预估，并独立作出投资决策，避免发生重大无法承受的风险。</span>
    </p>
    <p>
        <span>　　4、在您接受证券投资顾问服务之前，须了解本公司及其人员提供的投资建议具有针对性和时效性，不保证在任何市场环境下均能适用或长期有效。</span>
    </p>
    <p>
        <span>　　5、在您接受证券投资顾问服务之前，须了解本公司及其人员提供的投资建议所依据的证券研究报告和投资分析意见等，可能存在不准确、不全面或者被误读的风险，您可以向证券投资顾问了解证券研究报告的发布人和发布时间以及投资分析意见的来源，以便在进行投资决策时作出理性判断。</span>
    </p>
    <p>
        <span>　　6、在您接受证券投资顾问服务之前，须了解本公司证券投资顾问服务的收费标准和方式，按照公平、合理、自愿的原则与本公司协商并书面约定收取证券投资顾问服务费用的安排。证券投资顾问服务收费应向本公司账户支付，不得向证券投资顾问人员或其他个人账户支付。</span>
    </p>
    <p>
        <span>　　7、在您接受证券投资顾问服务之前，须了解本公司及其人员可能存在的道德风险，如发现投资顾问存在违法违规行为或利益冲突情形，如泄露客户投资决策计划、传播虚假信息、进行关联交易等，您可以向本公司投诉或向有关部门举报。</span>
    </p>
    <p>
        <span>　　8、在您接受证券投资顾问服务之前，须了解本公司存在因停业、解散、撤销、破产，或者被中国证监会撤销相关业务许可、责令停业整顿等原因导致不能履行职责的风险。</span>
    </p>
    <p>
        <span>　　9、在您接受证券投资顾问服务之前，须了解本公司的投资顾问人员存在因离职、离岗等原因导致更换投资顾问服务人员并影响服务连续性的风险。</span>
    </p>
    <p>
        <span>　　10、在您接受证券投资顾问服务之前，应向本公司说明自身资产与收入状况、投资经验、投资需求和风险偏好等情况并接受评估，以便于本公司根据您的风险承受能力和服务需求，向您提供适当的证券投资顾问服务。</span>
    </p>
    <p>
        <span>　　11、在您接受证券投资顾问服务之前，应向本公司提供有效的联系方式和服务获取方式，如有变动须及时向本公司进行说明，如因您自身原因或不可抗力因素导致您未能及时获取证券投资顾问服务，责任将由您自行承担。</span>
    </p>
    <p>
        <span>　　12、在您接受证券投资顾问服务时，应保管好自己的证券账户、资金账户和相应的密码，不要委托证券投资顾问人员管理自己的证券账户、资金账户，代理买卖证券，否则由此导致的风险将由您自行承担。</span>
    </p>
    <p>
        <span>　　13、在您接受证券投资顾问服务之前，须了解本公司所提供的证券投资顾问服务所依托的载体（如软件工具、终端设备等）的实际功能、信息来源、固有缺陷和使用风险，由于投资者自身原因导致该软件工具、终端设备等使用不当或受到病毒入侵、黑客攻击等不良影响的，由此导致的风险将由您自行承担。</span>
    </p>
    <p>
        <span>　　14、在您接受证券投资顾问服务之前，须了解可能影响您权益的主要风险，如信用风险、市场风险、流动性风险等。信用风险（也称违约风险）是指上市公司不能按时向证券持有人支付本息而给您造成损失的可能性，造成信用风险的直接原因是上市公司财务状况不好，最严重的是上市公司破产；市场风险是证券投资活动中最普通、最常见的系统性风险，是由证券价格的涨落直接引起的。尤其在新兴市场上，造成证券市场波动的因素更为复杂，价格波动更大，市场风险也更大，这将给您带来损失的可能，您将不得不承担由此造成的损失；流动性风险是指因市场成交量不足或缺乏愿意交易的对手，导致未能在理想的时点完成买卖的风险。与信用风险和市场风险相比，流动性风险形成的原因更加复杂和广泛，通常被视为一种综合性风险。基于上述不可抗力因素导致的风险将由您自行承担。</span>
    </p>
    <p>
        <span>　　15、在您接受证券投资顾问服务之前，须了解您自身是否借助杠杆（如融资融券、分级基金、股指期货、借贷、配资等）参与投资，因杠杆具备双向放大的功能，故可能直接导致您的损失加剧甚至超过您的原始本金，由此导致的风险将由您自行承担。</span>
    </p>
    <p>
        <span>　　16、在您接受证券投资顾问服务之前，须了解服务中所涉及到的各类信息均源于对公开信息的收集、整理，并力求信息的客观与公正，但不对所引用信息本身的准确性和完整性作出保证。</span>
    </p>
    <p>
        <span>　　17、在您接受证券投资顾问服务时，须确保信息传输所依托的网络通讯环境和您的终端设备畅通和在线；同时妥善保管好自己的私人信息（如您的基本信息、与本公司签订的证券投资顾问服务协议相关信息、与本公司正式签约后所获得的账号密码、您的投资决策等）。因泄露、遗失自己的私人信息受到的损失，将由您自行承担。</span>
    </p>
    <p>
        <span>　　18、本公司及其人员违反《证券投资顾问业务服务协议》及本《证券投资顾问业务风险揭示书》之约定，擅自所做的任何承诺一律无效，由此导致的不利后果由您自行承担。市场上，时有第三方假冒我公司名义拟与投资者建立投资顾问服务关系并收取各类费用，其行为构成诈骗，请您予以辨别，避免上当受骗，因此而遭受的损失，由您自行承担。</span>
    </p>
    <p>
        <span>　　<strong>本风险揭示书的揭示事项仅为列举性质，未能详尽列明投资者接受证券投资顾问服务所面临的全部风险和可能导致投资者投资损失的所有因素。</strong></span>
    </p>
    <p>
        <span>　　<strong>在您接受证券投资顾问服务前，应认真阅读并理解相关业务规则、证券投资顾问业务服务协议及本风险揭示书的全部内容。</strong></span>
    </p>
    <p>
        <span>　　<strong>接受证券投资顾问服务的您，自行承担投资风险，本公司不以任何方式向您作出不受损失或者取得最低收益的承诺。</strong></span>
    </p>
    <p>
        <span>　　<strong>特别提示：您签署本《证券投资顾问业务风险揭示书》，表明您已经理解并愿意自行享有接受证券投资顾问服务所获得的投资收益并自行承担接受证券投资顾问服务出现的风险损失。</strong></span>
    </p>
    <p>
        <span>　　<strong>以上《证券投资顾问服务协议》《证券投资顾问业务风险揭示书》本人书面签字或通过电子签约（如：勾选、点击“同意”等）以示签收，该揭示书的所有内容本人已阅读并完全理解与接受。本《证券投资顾问业务风险揭示书》作为《证券投资顾问服务协议》的附件，对您具有法律约束力。</strong></span>
    </p>
    <p>
        <span>　　支付协议</span>
    </p>
    <p>
        <span>　　特别提示：您在同意授权书前应完整、仔细地阅读本授权书，您勾选同意将被视为完全理解并接受以下全部授权书条款。您在华创证券上勾选同意本支付授权书后，即成为本支付授权书之授权人，该授权即刻发生效力。您如果不同意以下授权书条款，请勿勾选同意，且不要进行后续操作。</span>
    </p>
    <p>
        <span>　　支付授权书：</span>
    </p>
    <p>
        <span>　　一、授权人兹授权华创证券通过第三方支付平台划扣服务费，有效期限有且只有本次交易。</span>
    </p>
    <p>
        <span>　　二、服务费是指授权人通过华创证券提交的订单上记载的总费用。</span>
    </p>
    <p>
        <span>　　三、在授权人成功提交订单后，华创证券依照华创证券的收费规则计算支付费用。授权人应在5分钟内根据页面指示完成支付。</span>
    </p>
    <p>
        <span>　　四、如因授权人在第三方支付平台中的支付账户被锁定、无效、盗用、被往来银行拒绝等，以致支付账户请款失败时，华创证券有权依据与授权人之消费账单要求授权人支付相应费用。</span>
    </p>
    <p>
        <span>　　五、授权人如有冒用他人支付账户之行为，须自负法律责任。</span>
    </p>
    <p>
        <span>　　六、在使用华创证券服务的过程中，如授权人未遵从相关规则，则华创证券有权拒绝为授权人提供相关服务，且无需承担任何责任。因授权人的过错导致的任何损失由授权人承担，该等过错包括但不限于：不按照交易提示操作，未及时进行交易操作等。</span>
    </p>
    <p>
        <span>　　七、授权人同意其消费产生的费用，用以华创证券记录的数据为准，并通过华创证券告知授权人。授权人对服务费用有异议或扣款金额与应缴费用金额不符时，可及时与客服4000885558联系。</span>
    </p>
  </div>

</template>

<script>
  import apis from '../../apis/apis';
  export default {
    name: "searchinput",
    data() {
      return {
        personInfo:this.$route.query,
        form2: {
          //表单对象
          is_url:"",
          news_adstracts: "",
          product_id: [],//产品
          user_type: [],//推送人群
          kx_id: "",
          new_content: "",
          is_shares: "",
          product_name: "",
          mt_name:"",
          title: "",
          name:"",
        },
        kx_info:[],
        peoples:[],
        products:[],
        labelPosition: "right", //lable对齐方式
        labelWidth: "80px", //lable宽度
        rules:  {
        }
      };
    },
    mounted() {
      console.log(this.personInfo);
      this.selectRoleList();
      this.peopleList();
      this.productList();
      this.initCKEditor()
    },
    methods: {
      selectRoleList() {//初始化下拉框动态数据
          let param = 1;
          apis.msgApi.falshList(param)
          .then((data)=>{
            // console.log(data)
              if(data&&data.data){
                  var json=data.data.data;
                  if(json&&data.status==200){
                    this.kx_info = data.data.data;
                    // return kx_info;
                  }
              }

          })
          .catch((err)=>{
            this.$message({message: '执行失败，请重试',type: "error"});
          console.log(err)
          });
      },
      peopleList(){
        // 群推人群
          apis.msgApi.userTyle()
            .then((data)=>{
              // console.log(data)
                if(data&&data.data){
                    var json=data.data;
                    if(json&&data.status==200){
                      this.peoples = data.data;
                    }
                }

            })
            .catch((err)=>{
              this.$message({message: '执行失败，请重试',type: "error"});
              console.log(err)
            });
      },
      productList(){
        // 产品列表下拉
          apis.msgApi.productList()
            .then((data)=>{
              console.log(data)
                if(data&&data.data){
                    var json=data.data;
                    if(json&&data.status==200){
                      this.products = data.data;
                    }
                }

            })
            .catch((err)=>{
              this.$message({message: '执行失败，请重试',type: "error"});
              console.log(err)
            });
      },
      //初始化容器
      initCKEditor() {
              DecoupledEditor.create(document.querySelector('.document-editor__editable'), {
                  ckfinder: {
                      // 使用CKFinder QuickUpload命令将图像上传到服务器。
                      uploadUrl: '/api/img-api/upload'
                  }
              })
              .then(editor => {
                  const toolbarContainer = document.querySelector('.document-editor__toolbar');
                  toolbarContainer.appendChild(editor.ui.view.toolbar.element);//添加工具栏
                  this.EditorObj = editor;
              })
              .catch(err => {
                  console.error(err);
              });
      },
      //表单提交
      submitForm(form2) {
        this.$refs["form02"].validate(valid => {
          if(valid){
              let param = Object.assign({}, this.form2);
              debugger
              apis.msgApi.pushAdd(param)
              .then((data)=>{
                console.log(data);
                  if(data&&data.data){
                      var json=data.data;
                       if(json&&data.status==200){
                          this.$message({message: '执行成功',type: "success"});
                          this.dialogEdittVisible = false;
                          return;
                      }
                  }
                 this.$message({message: '执行失败，请重试',type: "error"});
              })
              .catch((err)=>{
                  this.$message({message: '执行失败，请重试',type: "error"});
              console.log(err)
              });
          }else {
            console.log("error submit!!");
            return false;
          }
        });
      },

    }
  };
</script>

<style>
  .contract{
    background-color: #FFFFFF;
    padding:1rem 2rem ;
  }
  .contract_title{
    font-size: 20px;
    font-weight: bold;
    text-align: center;
  }
   /* style="FONT-SIZE: 14px; FONT-FAMILY: 微软雅黑,Microsoft YaHei" */
</style>
